app/Models/Masters/DepartmentModel.php

    public function getAllDepartments()
    {
        return $this->findAll();
---
SELECT *
FROM `departments`